using ExcelShSy.Core.Interfaces.Shop;

using static ExcelShSy.Infrastructure.Persistance.DefaultValues.AvailabilityConstant;

namespace ExcelShSy.Infrastructure.Persistance.ShopData.Datas
{
    public record PromData : IShopTemplate
    {
        public IReadOnlyList<string> UnmappedHeaders =>
        [
            "Код_товару",
                    "Назва_позиції",
                    "Назва_позиції_укр",
                    "Пошукові_запити",
                    "Пошукові_запити_укр",
                    "Опис",
                    "Опис_укр",
                    "Тип_товару",
                    "Ціна",
                    "Валюта",
                    "Одиниця_виміру",
                    "Мінімальний_обсяг_замовлення",
                    "Оптова_ціна",
                    "Мінімальне_замовлення_опт",
                    "Посилання_зображення",
                    "Наявність",
                    "Кількість",
                    "Номер_групи",
                    "Назва_групи",
                    "Посилання_підрозділу",
                    "Можливість_поставки",
                    "Термін_поставки",
                    "Спосіб_пакування",
                    "Спосіб_пакування_укр",
                    "Унікальний_ідентифікатор",
                    "Ідентифікатор_товару",
                    "Ідентифікатор_підрозділу",
                    "Ідентифікатор_групи",
                    "Виробник",
                    "Країна_виробник",
                    "Знижка",
                    "ID_групи_різновидів",
                    "Особисті_нотатки",
                    "Продукт_на_сайті",
                    "Термін_дії_знижки_від",
                    "Термін_дії_знижки_до",
                    "Ціна_від",
                    "Ярлик",
                    "HTML_заголовок",
                    "HTML_заголовок_укр",
                    "HTML_опис",
                    "HTML_опис_укр",
                    "Код_маркування_(GTIN)",
                    "Номер_пристрою_(MPN)",
                    "Вага,кг",
                    "Ширина,см",
                    "Висота,см",
                    "Довжина,см",
                    "Де_знаходиться_товар",
                    "Назва_Характеристики",
                    "Одиниця_виміру_Характеристики",
                    "Значення_Характеристики"
        ];

        public IReadOnlyDictionary<string, string> AvailabilityMap => new Dictionary<string, string>
        {
            { InStock, "+" },
            { OnOrder, "5" },
            { OutOfStock, "-" },
            { ReadyToGo, "!" }
        };

        public string DataFormat => "";
    }
}
