using static ExcelShopSync.Core.Static.Shops;
using static ExcelShopSync.Core.Static.AvailabilityKeys;

namespace ExcelShopSync.Core.Static
{
    class ShopTemplate
    {
        public static Dictionary<string, List<string>> Shops = new()
        {
            {
                Horoshop, new List<string>
                {
                    "Галерея",
                    "Обзор 360",
                    "Алиас",
                    "Ссылка",
                    "Дата добавления",
                    "HTML title (UA)",
                    "HTML title (RU)",
                    "Единицы измерения",
                    "META keywords (UA)",
                    "META keywords (RU)",
                    "META description (UA)",
                    "META description (RU)",
                    "h1 заголовок (UA)",
                    "h1 заголовок (RU)",
                    "Минимальный заказ",
                    "Поставщик",
                    "Иконки",
                    "Популярность",
                    "Скидка %",
                    "Описание товара (UA)",
                    "Описание товара (RU)",
                    "Количество",
                    "Короткое описание (UA)",
                    "Короткое описание (RU)",
                    "Тип гарантии",
                    "Цвет",
                    "Гарантийный срок, мес.",
                    "Дата и время окончания акции",
                    "Текст акции (UA)",
                    "Текст акции (RU)",
                    "Описание для маркетплейсов (UA)",
                    "Описание для маркетплейсов (RU)",
                    "Выгружать на маркетплейсы",
                    "Состояние товара",
                    "Только для взрослых",
                    "Код УКТ ВЭД",
                    "«Оплата частями» ПриватБанка",
                    "«Покупка частями» от monobank",
                    "Уникальный код налога",
                    "Штрихкод",
                    "Код производителя товара (MPN)",
                    "На складе для Prom",
                    "Электронный товар",
                }
            },
            {
                Prom, new List<string>
                {
                    "Код_товару",
                    "Назва_позиції",
                    "Назва_позиції_укр",
                    "Пошукові_запити",
                    "Пошукові_запити_укр",
                    "Опис",
                    "Опис_укр",
                    "Тип_товару",
                    "Ціна",
                    "Валюта",
                    "Одиниця_виміру",
                    "Мінімальний_обсяг_замовлення",
                    "Оптова_ціна",
                    "Мінімальне_замовлення_опт",
                    "Посилання_зображення",
                    "Наявність",
                    "Кількість",
                    "Номер_групи",
                    "Назва_групи",
                    "Посилання_підрозділу",
                    "Можливість_поставки",
                    "Термін_поставки",
                    "Спосіб_пакування",
                    "Спосіб_пакування_укр",
                    "Унікальний_ідентифікатор",
                    "Ідентифікатор_товару",
                    "Ідентифікатор_підрозділу",
                    "Ідентифікатор_групи",
                    "Виробник",
                    "Країна_виробник",
                    "Знижка",
                    "ID_групи_різновидів",
                    "Особисті_нотатки",
                    "Продукт_на_сайті",
                    "Термін_дії_знижки_від",
                    "Термін_дії_знижки_до",
                    "Ціна_від",
                    "Ярлик",
                    "HTML_заголовок",
                    "HTML_заголовок_укр",
                    "HTML_опис",
                    "HTML_опис_укр",
                    "Код_маркування_(GTIN)",
                    "Номер_пристрою_(MPN)",
                    "Вага,кг",
                    "Ширина,см",
                    "Висота,см",
                    "Довжина,см",
                    "Де_знаходиться_товар",
                    "Назва_Характеристики",
                    "Одиниця_виміру_Характеристики",
                    "Значення_Характеристики"
                }
            },
            {
                Rozetka, new List<string>
                {
                    "ID",
                    "OFFERID",
                    "CID",
                    "Категорія",
                    "Артикул",
                    "Назва",
                    "Назва (укр)",
                    "Серія",
                    "Ціна",
                    "Стара ціна",
                    "Ціна промо",
                    "Залишки",
                    "Мінімальна кількість при замовленні",
                    "Максимальна кількість при замовленні",
                    "Виробник",
                    "Наявність",
                    "Статус",
                    "Повний опис (UA/RU)",
                    "Повний опис (UA)",
                    "Зображення",
                    "Гарантія|20769",
                    "Довжина|24935",
                    "Дополнительный текст;RU|21875",
                    "Дополнительный текст;UA|21875",
                    "Доставка/Оплата;RU|2019",
                    "Доставка/Оплата;UA|2019",
                    "Кнопка передзамовлення|232597",
                    "Потужність на квадратний метр|24931",
                    "Призначення|243713",
                    "Загальна потужність|26288",
                    "Площа|35484",
                    "Призначення|176472",
                    "Термін доставки|252319",
                    "Країна-виробник товару|98900",
                    "Монтаж|220893",
                    "Ширина|24948"
                }
            },
            {
                Epicenter, new List<string>
                {
                    "№",
                    "Артикул*",
                    "Ціна*",
                    "Стара ціна",
                    "Фото товару*",
                    "Наявність*",
                    "Основна категорія*",
                    "Бере участь в акціях",
                    "Додаткові характеристики (text)[ru]",
                    "Додаткові характеристики (text)[ua]",
                    "Вид* (multiselect)",
                    "Колір* (multiselect)",
                    "Мінімальна кратність товару* (float)",
                    "Опис (text)[ru]",
                    "Опис (text)[ua]",
                    "Колекція (select)",
                    "Вага* (float) (кг)",
                    "Серія (select)",
                    "Модель виробника (референцiя) (string)",
                    "Штрих код (array)",
                    "Одиниця виміру та кількість* (select)",
                    "Висота упаковки* (float) (мм)",
                    "Глибина упаковки* (float) (мм)",
                    "Вага упаковки* (float) (г)",
                    "Ширина упаковки* (float) (мм)",
                    "Модель (multiselect)",
                    "Бренд* (select)",
                    "Країна-виробник* (select)",
                    "Набір атрибутів*",
                    "id (не редагується)",
                    "Статус (не редагується)"
                }
            }
        };

        public static Dictionary<string, Dictionary<string, string>> AvaibilityPref = new()
        {
            {
                Horoshop, new Dictionary<string, string>()
                {
                    { InStock, "В наявності" },
                    //{ OnOrder, "" },
                    { OutOfStock, "Не в наявності" },
                    { ReadyToGo, "в наявності" }
                }
            },
            {
                Prom, new Dictionary<string, string>()
                {
                    { InStock, "+" },
                    //{ OnOrder, Settings.DefaultTimeOffset.ToString() },
                    { OutOfStock, "-" },
                    { ReadyToGo, "!" }
                }
            },
            {
                Rozetka, new Dictionary<string, string>()
                {
                    { InStock, "В наявності" },
                    { OutOfStock, "Не в наявності" },
                    //{ OnOrder, "Под заказ" },
                    { ReadyToGo, "Готов к отправке" }
                }
            },
            {
                Epicenter, new Dictionary<string, string>()
                {
                    { InStock, "в наявності" },
                    { OutOfStock, "немає в наявності" },
                    //{ OnOrder, "в наявності" },
                    { ReadyToGo, "в наявності" },

                }
            },
        };
    }
}
