Repository: FreidFry/ExcelShopSync
Catalog: ExcelShSy.Localization/Resources/Errors.*.resx
Languages: uk_ua

source: No fetch shops!
uk_ua: Відсутні завантажені магазини!

# CloseWarning
source: Please close window!
uk_ua: Будь ласка, закрийте вікно!

# CloseWarningText
source: Please close {0}!
uk_ua: Будь ласка, закрийте {0}!

# ShopNotFound
source: Shop {0} not found. Do you want to add it?
uk_ua: Магазин {0} не найден. Хочете додати його?

# NoShopFile
source: File store not found
uk_ua: Файл магазину не знайдено

# NoShopFileText
source: The file for this store was not found.
uk_ua: Файл цього магазину не знайдено

# ShopExistText
source: A store with that name already exists.
uk_ua: Магазин з такою назвою вже існує.

# ShopExist
source: Conflict over the name of the store
uk_ua: Конфлікт імені магазину

# NetworkErrorTitle
source: Network Error
uk_ua: Помилка мережі

# NetworkErrorText
source: A network error occurred. Please check your internet connection and try again.
uk_ua: Сталася помилка мережі. Перевірте підключення до інтернету та спробуйте ще раз.

# UnknownErrorTitle
source: Unknown Error
uk_ua: Невідома помилка

# UnknownErrorText
source: An unexpected error occurred. Please try again or contact the developer if the problem persists.
uk_ua: Сталася непередбачена помилка. Спробуйте ще раз або зверніться до розробника, якщо проблема не зникне.

# UnsupportedOSUpdateTitle
source: Update Not Supported
uk_ua: Оновлення не підтримується

# UnsupportedOSUpdateText
source: Your operating system version is not supported for this update. Please update your OS or contact the developer.
uk_ua: Ваша версія операційної системи не підтримується для цього оновлення. Будь ласка, оновіть ОС або зверніться до розробника.

# ErrorNoSheets
source: No sheets found in file "{0}".
uk_ua: У файлі "{0}" відсутні листи.

# ErrorNoShopName
source: No suitable template was found for the shop in file "{0}". Please check the file contents or create a template.
uk_ua: Для магазину з файлу "{0}" не знайдено відповідний шаблон. Будь ласка, перевірте вміст файлу або створіть шаблон.
