Repository: FreidFry/ExcelShopSync
Catalog: ExcelShSy.Localization/Resources/MessagesBox.*.resx
Languages: uk_ua

source: Confirm
uk_ua: Підтвердження

# ConfirmText
source: Are you sure you want a {0}% increase?
uk_ua: Ви впевнені, що хочете збільшення на {0}%?

# Finish
source: Finished
uk_ua: Завершено

# FinishText
source: Finished without errors.
uk_ua: Завершено без помилок.

# FinishWithProblems
source: Finished with problems.
uk_ua: Завершено з проблемами.

# FinishWithProblemsText
source: Finished with on problems:
uk_ua: Завершено з проблемами:

# ThisVersionLatestTitle
source: No Update Needed
uk_ua: Оновлення не потрібне

# ThisVersionLatestText
source: You already have the latest version of the application.
uk_ua: У вас вже встановлена остання версія програми.

# UpdatesAvailableTitle
source: Updates Available
uk_ua: Доступні оновлення

# UpdatesAvailableText
source: A new version of the application is available. Would you like to update now?
uk_ua: Доступна нова версія програми. Бажаєте оновити зараз?
